       ID DIVISION.           
       PROGRAM-ID. ASAMPLE.                                           
       ENVIRONMENT DIVISION.                                          
       DATA DIVISION.                                                 
       WORKING-STORAGE SECTION.   
       COPY DATVARS.                                           
       PROCEDURE DIVISION.                                            
           DISPLAY 'asample: test build Demo DBBS  5'.
           STOP RUN.