       ID DIVISION.           
       PROGRAM-ID. ASAMPLE.                                           
       ENVIRONMENT DIVISION.                                          
       DATA DIVISION.                                                 
       WORKING-STORAGE SECTION.   
       COPY DATVARS.                                           
       PROCEDURE DIVISION.                                            
           DISPLAY 'asample: hn test v5 file type ssh key'.
           STOP RUN.