//IBMUSERB JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//DEMO     EXEC PGM=ASAMPLE
//STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD  VSCode builds
//SYSOUT   DD SYSOUT=*
