//IBMUSERB JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//*
//* Debug demo - NOT COMPILED WITH TEST 
//DBUG    EXEC PGM=DEMO
//STEPLIB  DD  DISP=SHR,DSN=ZDEV.FEATURE.LOAD
//SYSOUT   DD SYSOUT=*
//CEEOPTS  DD *
TEST(ALL,,,RDS:*)
//*
