//IBMUSERC JOB CLASS=A,REGION=0M,MSGCLASS=A
//* test my cpphello pgm
//DEMO     EXEC PGM=HELLO
//STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//SYSOUT   DD SYSOUT=*
