
NOT NEEDED User BUild uses rpl lib ibmuser.vscode.load 

//IBMUSERC JOB CLASS=A,MSGCLASS=H
//* copy the user build load to a CICS DFHRPL LIB   
//*            
//COPYSTEP EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//SYSUT2   DD  DISP=SHR,DSN=ZDEV.MAIN.CICSLOAD
//SYSIN    DD  *
  COPYGRP  OUTDD=SYSUT2,INDD=((SYSUT1,R))
   SELECT   MEMBER=(EPSMORT,EPSCMORT,EPSCSMRD,EPSCSMRT,EPSMLIS,EPSMPMT)
   SELECT   MEMBER=(EPSNBRVL)
/*