//IBMUSERS JOB CLASS=A,MSGCLASS=H 
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//EQADPFMB DD  DSN=CICSTS62.CICS.EQADPFMB,DISP=SHR
//SYSIN    DD *
  PRINT INFILE(EQADPFMB) 

/*
