//IBMUSERS JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//* Sort Proc example   v2
//MYPROCS  JCLLIB   ORDER=IBMUSER.ZBUILDER.PROC   
//SORTSTEP EXEC SORTPROC,CNTL=MYSORT     
//SORTIN   DD * 
Nelson Lopez    line 1 
FRANK ZAPPA     line 2 
The Eagels      line 3 
The Classics    line 4
/*
