//IBMUSERC JOB CLASS=A,MSGCLASS=H
//COPYSTEP EXEC PGM=IEBCOPY
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DISP=SHR,DSN=IBMUSER.IDZ.LOAD
//SYSUT2   DD  DISP=SHR,DSN=ZDEV.MAIN.CICSLOAD
//SYSIN    DD  *
  COPYGRP  OUTDD=SYSUT2,INDD=((SYSUT1,R))
   SELECT   MEMBER=(DATDEMO,DATSUB,DATMAPM)
/*
