//IBMUSERN JOB CLASS=A,MSGCLASS=H
//NOP EXEC PGM=IEFBR14
//* DONT FORGET TO COPYLOAD JCL
// COMMAND 'F CICSTS62,CEMT SET PROG(DATDEMO) NEWCOPY'
// COMMAND 'F CICSTS62,CEMT SET PROG(DATSUB)  NEWCOPY'
// COMMAND 'F CICSTS62,CEMT SET PROG(DATMAPM) NEWCOPY'
