//IBMUSERA JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//* Job to test DATBATCH code
//* PARM defines which business rule to run (1 or 2)
//DEMO     EXEC PGM=DATBATCH,PARM='1'
//*STEPLIB  DD  DISP=SHR,DSN=IBMUSER.IDZ.LOAD
//STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD
//*STEPLIB  DD  DISP=SHR,DSN=ZDEV.MAIN.LOAD
//SYSOUT   DD SYSOUT=*
