//IBMUSERN JOB CLASS=A,MSGCLASS=H
//* JOB to run a CICS Newcopy 
//* DONT FORGET TO RUN THE REFRESH JOB FIRST  
//NOP EXEC PGM=IEFBR14
// COMMAND 'F CICSTS62,CEMT SET PROG(DATDEMO) NEWCOPY'
// COMMAND 'F CICSTS62,CEMT SET PROG(DATMAPM)  NEWCOPY'

